app/controllers/users/omniauth_callbacks_controller.rb

  def facebook
    # You need to implement the method below in your model (e.g. app/models/user.rb)
    @user = User.from_omniauth(request.env["omniauth.auth"])

    if @user.persisted?
      sign_in_and_redirect @user, :event => :authentication #this will throw if @user is not activated
      set_flash_message(:notice, :success, :kind => "Facebook") if is_navigational_format?
    else
      @user.save!
---
INSERT INTO "users" ("provider", "uid", "email", "encrypted_password", "firstname", "lastname", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
UPDATE "users" SET "current_sign_in_at" = $1, "sign_in_count" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["current_sign_in_at", "2016-02-29 13:27:22.424040"], ["sign_in_count", 2], ["updated_at", "2016-02-29 13:27:22.427499"], ["id", 5]]